#+TITLE: Контрольная работа № 2 Матрицы 1 вариант
#+AUTHOR: Студент группы № 6005 Пыхалов Олег Витальевич
#+EMAIL: opykhalov@yandex.ru
#+OPTIONS: email:t

#+LANGUAGE: ru
#+LaTeX_HEADER: \usepackage[T1,T2A]{fontenc}
#+LaTeX_HEADER: \usepackage[english,russian]{babel}
#+LATEX_HEADER: \hypersetup{colorlinks, citecolor=black, filecolor=black, linkcolor=black, urlcolor=blue, unicode}
#+LATEX_HEADER: \usepackage{anyfontsize}

#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \mathtoolsset{showonlyrefs}

#+OPTIONS: H:2 toc:t num:t todo:nil

*** DONE Find a determenant
    CLOSED: [2016-11-03 Thu 11:35]

 #+BEGIN_EXPORT latex
 \begin{equation}
   \begin{aligned}
     \mathrm{det}(\mathbf{A}) =
     \begin{bmatrix}
       1 &
       -1 &
       -2 \\
       & & \\
       -1 &
       -1 &
       3 \\
       & & \\
       -1 &
       0 &
       6
     \end{bmatrix}
     =
     \begin{bmatrix}
       1 &
       -1 &
       -2 \\
       & & \\
       -1 &
       -1 &
       3 \\
       & & \\
       -1 &
       0 &
       6
     \end{bmatrix}
     \begin{matrix}
       1 &
       -1 &
       & & \\
       & & \\
       -1 &
       -1 &
       & & \\
       & & \\
       -1 &
       0 &
       & & \\
     \end{matrix} \\
     \mathrm{det}(\mathbf{A})
     = 1 \cdot (-1) \cdot 6
     + (-1) \cdot 3 \cdot (-1)
     + (-2) \cdot (-1) \cdot 0 \\
     - (-1) \cdot (-1) \cdot 6
     - 1 \cdot 3 \cdot 0
     - (-2) \cdot (-1) \cdot (-1) \\
     = -6 + 3 + 0 - 6 - 0 - (-2) \\
     = -6 + 3 - 6 + 2 \\
     = -12 + 5 \\
     = -7
   \end{aligned}
 \end{equation}
 #+END_EXPORT

 #+BEGIN_SRC python :exports none
 original = 1*(-1)*6+(-1)*3*(-1)+(-2)*(-1)*0-(-1)*(-1)*6-1*3*0-(-2)*(-1)*(-1)
 a = 1*(-1)*6
 b = -1*3*-1
 c = -2*-1*0
 d = -1*-1*6
 e = -1*3*0
 f = -2*-1*-1
 g = a + b + c - d - e - f
 return g
 #+END_SRC

 #+RESULTS:
 : -7

** Solving with python                                             :noexport:

 #+BEGIN_SRC python
   from numpy import matrix
   a = matrix((1,-1,2,0,-1,1))
   b = matrix((0,1,1,-1,0,2))

   a = matrix((0,0,-1,-1,-1,-1))
   b = matrix((0,1,1,-1,0,2))

   a = matrix((0,0,0,-1,1,0))
   b = matrix((0,0,1,1,1,1))

   a = matrix((0,0,-3,0,-6,-3))
   b = matrix((1,0,3,-1,-1,3))

   a = matrix((0,0,0,1,-1,0))
   b = matrix((1,0,0,-1,-7,0))

   a = matrix((0,1,0,-2,-1,1))
   b = matrix((0,0,0,2,-2,0))

   ret = a + b

   return ret
 #+END_SRC

 #+RESULTS:
 | 0 | 1 | 0 | 0 | -3 | 1 |

